Белгипрозем_2017/src/Documents/мДеноминацияУчетДоговоров/мДеноминацияУчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мДеноминацияУчетДоговоров</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.мСтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсвобождениеОтНДС</name>
      <type>
        <types>CatalogRef.мОсвобождениеОтНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДо</name>
      <comment>Сумма с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПосле</name>
      <comment>Сумма с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДСДо</name>
      <comment>НДС до деноминации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДСПосле</name>
      <comment>НДС после деноминации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяДо</name>
      <comment>Сметная стоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяПосле</name>
      <comment>Сметная стоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/УчетДоговоров/УчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетДоговоров</name>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДоговор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчастков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смета</name>
    <type>
      <types>CatalogRef.мСметы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Белгипрозем_2017/src/Documents/мДеноминацияУчетДоговоров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мДеноминацияУчетДоговоровУчетДоговоров.Договор.Корреспондент КАК Корреспондент,
		|	мДеноминацияУчетДоговоровУчетДоговоров.Договор,
		|	мДеноминацияУчетДоговоровУчетДоговоров.ЭтапДоговора,
		|	мДеноминацияУчетДоговоровУчетДоговоров.ЭтапДоговора.Подразделение КАК Подразделение,
		|	мДеноминацияУчетДоговоровУчетДоговоров.СуммаПосле КАК Сумма,
		|	мДеноминацияУчетДоговоровУчетДоговоров.НДСПосле КАК НДС,
		|	мДеноминацияУчетДоговоровУчетДоговоров.ОсвобождениеОтНДС,
		|	мДеноминацияУчетДоговоровУчетДоговоров.СтавкаНДС,
		|	ЕСТЬNULL(мДеноминацияУчетДоговоровУчетДоговоров.ЭтапДоговора.КоличествоУчастков, 1) КАК КоличествоУчастков,
		|	""#Деноминация"" КАК Комментарий
		|ИЗ
		|	Документ.мДеноминацияУчетДоговоров.УчетДоговоров КАК мДеноминацияУчетДоговоровУчетДоговоров
		|ГДЕ
		|	мДеноминацияУчетДоговоровУчетДоговоров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Док = Документы.УчетДоговоров.СоздатьДокумент();
		Док.Дата = НачалоДня(Ссылка.Дата);
		ЗаполнитьЗначенияСвойств(Док, Выборка);
        
        //Если Выборка.СтавкаНДС = Справочники.мСтавкиНДС.НДС_20 Тогда
        //    Док.НДС = Окр(Док.Сумма / 120*20, 2);
        //КонецЕсли; 
		Если Выборка.КоличествоУчастков > 1 Тогда 
			Док.Цена = Выборка.Сумма / Выборка.КоличествоУчастков;
		ИначеЕсли Выборка.КоличествоУчастков = 1 Тогда	
		    Док.Цена = Выборка.Сумма;
		ИначеЕсли Выборка.КоличествоУчастков = 0 Тогда	
		    Док.КоличествоУчастков = 1;
		    Док.Цена = Выборка.Сумма;
		КонецЕсли;
		
		Попытка
		
			Док.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
			Сообщить("Не проведен Учет договоров по "+Выборка.Корреспондент+" "+Выборка.Договор+" "+Выборка.ЭтапДоговора);		
		КонецПопытки;
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	//Документы.мДеноминацияУчетДоговоров.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	//ЗапасыСервер.ОтразитьУчетДоговоров(ДополнительныеСвойства, Движения, Отказ);

	//ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Удаление документов Учет договоров
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетДоговоров.Ссылка
		|ИЗ
		|	Документ.мДеноминацияУчетДоговоров.УчетДоговоров КАК мДеноминацияУчетДоговоровУчетДоговоров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УчетДоговоров КАК УчетДоговоров
		|		ПО мДеноминацияУчетДоговоровУчетДоговоров.Договор = УчетДоговоров.Договор
		|			И мДеноминацияУчетДоговоровУчетДоговоров.ЭтапДоговора = УчетДоговоров.ЭтапДоговора
		|ГДЕ
		|	мДеноминацияУчетДоговоровУчетДоговоров.Ссылка = &Ссылка
		|	И НЕ УчетДоговоров.ПометкаУдаления
		|	И УчетДоговоров.Комментарий ПОДОБНО ""#Деноминация%""
		|	И УчетДоговоров.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Ссылка.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Ссылка.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Док.УстановитьПометкуУдаления(Истина);
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	
	//ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры
